ATARI/fluidDynamics/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    ".*"
    {
        type            noSlip;
    }
    // "(pump|hex).*"
    // {
    //     type            slip;
    // }

    "outlet.*"
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }

    "inlet.*"
    {
        type                flowRateInletVelocity;
        massFlowRate        3200;
        extrapolateProfile  yes;
        value               uniform (0 0 0);
    }
}
