ATARI/fluidDynamics/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    ".*"
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    // "(pump|hex_body).*"
    // "hex_body.*"
    // {
    //     type            zeroGradient;
    // }

    "outlet.*"
    {
        type            zeroGradient;
    }

    "inlet.*"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
