ATARI/fluidDynamics/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    // plenum
    // {
    //     type            fixedValue;
    //     value           $internalField;
    // }

    ".*"
    {
        type            zeroGradient;
        // type            fixedFluxPressure;
        // value           $internalField;
    }

    "outlet.*"
    {
        type            fixedValue;
        value           $internalField;
    }

    "inlet.*"
    {
        type            fixedFluxExtrapolatedPressure;
    }
}


// ************************************************************************* //
