ATARI/fluidDynamics/Allrun.pre
#!/bin/sh

cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

#create meshes
#runApplication         blockMesh
#runApplication -s pipe blockMesh -region pipe

# create dummy files for post-processing
paraFoam -touch
# paraFoam -touch -region primary

#cp -rf 0.orig 0
