ATARI/fluidDynamics/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  FDIC;
        tolerance       1e-7;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-7;
        relTol          0;
    }

    p_rgh
    {
        // solver          PCG;
        // preconditioner  FDIC;
        // tolerance       1e-6;
        // relTol          0.01;

        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;

        smoother         GaussSeidel;

        minIter         3;              // a minimum number of iterations
        maxIter         100;            // limitation of iterions number
        nPreSweeps      1;              // 1 for pressure, set to 0 for others
        nPostSweeps     2;              // 2 is fine
        nFinestSweeps   2;              // 2 is fine
        scaleCorrection true;           // true is fine
        directSolveCoarsestLevel false; // false is fine
        cacheAgglomeration on;          // on is fine; set to off, if dynamic
                                        // mesh refinement is used!
        nCellsInCoarsestLevel 2500;     // approximately sqrt(number of cells)
        agglomerator    faceAreaPair;   // faceAreaPair is fine
        mergeLevels     1;              // 1 is fine
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-7;
        relTol          0;
    }

    "(U|h|TStructures|epsilon|k)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(U|h|TStructures|epsilon|k)Final"
    {
        $U;
        tolerance       1e-7;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   true;

    // pRefCell    0;
    // pRefValue   1e5;

    nOuterCorrectors            50;
    nCorrectors                 2;
    nNonOrthogonalCorrectors    0;

    residualControl
    {
        U   1e-2;
        h   1e-5;
    }

    outerCorrectorResidualControl
    {
        U
        {
            tolerance   5e-2;
            relTol      0;
        }
        p_rgh
        {
            tolerance   5e-2;
            relTol      0;
        }
        h
        {
            tolerance   1e-1;
            relTol      0;
        }
    }
}

relaxationFactors
{
    fields
    {
        // p_rgh           1;
        // p_rghFinal      1;
        // "p_rgh.*"       1;
    }
    equations
    {
        "U"             0.9;
        "h"             0.9;
        "(U|h)Final"    1;
        // "(U|h).*"       1; No distinction for Final iteration... probably not a good idea.
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 0;
}

cache
{
    grad(U);
}


// ************************************************************************* //
