ATARI/fluidDynamics/system/writeObject
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out specified objects, e.g. fields, stored on the case database.

\*---------------------------------------------------------------------------*/

type            writeObjects;
libs            ("libutilityFunctionObjects.so");

region          primary;

objects         (correlation.heatTransferCoefficient);

writeControl    writeTime;

// ************************************************************************* //
